package com.jpdevzone.knowyourdreams

object Constants {

    val favourites = ArrayList<Dream>()
    val history = ArrayList<Dream>()

    fun getDreams(): ArrayList<Dream> {
        val dreams = ArrayList<Dream>()

        val dream1 = Dream(
            "АБАЖУР",
            "Ако сънувате абажур — скоро ще тръгнете на неочакван път; ако го държите в ръка — това показва липса на искреност от ваша страна или от страна на тези, която вя заобикалят; ако абажурът е счупен — откажете се от пътуване."
        )

        dreams.add(dream1)

        val dream2 = Dream(
            "АБАТ",
            "Ако католик сънува абат — то на него му предстои голям успех; ако го виждате или само разговаряте с него — радост във вашето семейство."
        )

        dreams.add(dream2)

        val dream3 = Dream(
            "АБАТСТВО",
            "Ако сънувате абатство — ще имате морални или интелектуални затруднения; ако е развалено — идва край на мъките ви или поне те няма да продължават дълго."
        )

        dreams.add(dream3)

        val dream4 = Dream(
            "АБИТУРИЕНТ",
            "Ако сънувате абитуриент — ще научите лоша новина за този, когото сънувате като абитуриент; ако сте те Вие — на вашия път ще се изпречи препятствие."
        )

        dreams.add(dream4)

        val dream5 = Dream(
            "АБОРТ",
            "Ако сънувате или правите аборт — ще имате малки неприятности; ако друг го прави — клевета, страх."
        )

        dreams.add(dream5)

        val dream6 = Dream(
            "АВАНТЮРИСТ",
            "Ако сънувате или разговаряте с авантюрист — очаква ви опасност; ако сте вие — предстои ви дълга сексуална нощ."
        )

        dreams.add(dream6)

        val dream7 = Dream(
            "АВЕЛ",
            "Библейски брат на Каин. Ако сънувате или разговаряте с Авел — скръб; ако сте вие — ще имате големи грижи."
        )

        dreams.add(dream7)

        val dream8 = Dream(
            "АВТОБУС",
            "Ако сънувате автобус — очаква Ви професионален успех; ако се возите на него — очаква Ви забавяне на професионалното Ви издигане; ако е разбит — временен успех, ако не се погрижите той да продължи, понякога може и да означава проблем със здравето."
        )

        dreams.add(dream8)

        val dream9 = Dream(
            "АВТОМАТ",
            "Ако сънувате автомат (оръжие) — вие имате скрит враг; ако сънувате механична кукла или игрален автомат, — предвещава благополучие в духовния ви живот; ако е счупен — приятна беседа."
        )

        dreams.add(dream9)

        val dream10 = Dream(
            "АВТОМОБИЛ",
            "Ако сънувате или се возите на автомобил-ще имате успех в бизнеса; ако го гледате — очаквайте новини ако е катастрофирал — отложете плановете за деня; ако го купувате — предстои ви важно събитие; ако го продавате — предприятието ви ще сполучи."
        )

        dreams.add(dream10)

        val dream11 = Dream(
            "АВТОР",
            "Ако сънувате някой автор — очаква ви интересна и весела беседа; ако разговаряте или спорите с него — очаква Ви неудача в работата ви; ако сте вие — предстоят ви големи грижи."
        )

        dreams.add(dream11)

        val dream12 = Dream(
            "АГЕНТ",
            "Ако сънувате или разговаряте с агент — незабавно купете акции; ако сте вие — не се доверявайте на мъж за проблеми които ви безпокоят."
        )

        dreams.add(dream12)

        val dream13 = Dream(
            "АГИТАТОР",
            "Ако сънувате или разговаряте с агитатор - ще направите неприятно впечатление; ако сте вие — ще загубите честта си; ако се карате с него — вашето желание няма да се сбъдне."
        )

        dreams.add(dream13)

        val dream14 = Dream(
            "АГНЕ",
            "Ако сънувате агнета — очаква ви успех и покой; ако те почиват или пасат на сянка — вие имате добра и благородна душа; ако си играете с тях — радост от деца; ако носите агне щастие и благосъстояние; ако го намерите — за добър човек ще се ожените; ако загубите агнета — не вярвайте на интимния си приятел; ако ги ядете — ще станете свидетели на семе дал; ако ги храните или галите — ще имате почтена съпруга; ако са заспали — предвещава загуба; ако сте мъж и сънувате агнета като пасат — скоро ще се задомите; ако колите агне — жесток човек; ако почиствате вътрешностите му — важно посещение; ако го купувате — радост в семейството, ако го продавате — ще изпуснете изгоден брак; ако е новородено-ще имате честна жена; ако виждате библейското жертвоприношение на агне — неочаквано известие, което ще промени и на живот."
        )

        dreams.add(dream14)

        val dream15 = Dream(
            "АГОНИЯ",
            "Ако сънувате агония — това е мъчителен сън, но без никакви лоши последствия; ако вие сте в агония — ще се радвате на добро здраве; ако е друг — някой мисли за вас и ще ви го докаже в скоро време; ако гледате агония на умиращ — очакват ви щастливи мигове."
        )

        dreams.add(dream15)

        val dream16 = Dream(
            "АД",
            "Ако сънувате ада — ще имате среща с някого, който ще ви окаже помощ; ако сте в ада — Бог ви призовава към покаяние и да се осланяте на милостта му; ако излизате от ада — дебне ви опасност; ако ви измъчват в ада — поради загуба на апетит ще се разболеете; ако сънувате вратата на ада — очакват ви грижи и неволи; ако тя се отваря или затваря — ще се избавите от голяма опасност."
        )

        dreams.add(dream16)

        val dream17 = Dream(
            "АДВОКАТ",
            "Ако сънувате или разговаряте с адвокат — ще имате малки неприятности; ако го гледате — ще ви поканят в сдружение; ако чувате гласа му — големи грижи; ако води съдебно дело — ще научите лоши новини от ваш приятел; ако имате работа с него — справедливостта за вас ще победи; ако сте вие — очаква ви бърз и близък успех."
        )

        dreams.add(dream17)

        val dream18 = Dream(
            "АДМИНИСТРАТОР",
            "Ако сънувате администратор — на пътя ви ще се появи неочаквано препятствие; ако разговаряте с него — ще имате семейни грижи; ако сте вие — неочаквана среща с добър край."
        )

        dreams.add(dream18)

        val dream19 = Dream(
            "АДМИРАЛ",
            "Ако сънувате или разговаряте с адмирал — ще имате голям успех във вашата работа; ако сте вие — вашата кариера е в неизвестност."
        )

        dreams.add(dream19)

        val dream20 = Dream(
            "АДРЕС",
            "Ако сънувате или пишете адрес — очаквайте новина в скоро време; ако го гледате — ще ви дойдат гости; ако го четете — не започвайте нова работа; ако сънувате вашия адрес — ще прекарате приятно вечерта; ако го давате на някого — новини от този, на когото го давате; ако го забравите — ще забравите да предадете новини, касаещи разрешаването на вашия проблем."
        )

        dreams.add(dream20)

        val dream21 = Dream(
            "АДРЕСНА КНИГА",
            "Ако сънувате адресна книга — вашето семейство ще се увеличи; ако я попълвате — вие сте в неизвестност."
        )

        dreams.add(dream21)

        val dream22 = Dream(
            "АДЮТАНТ",
            "Ако сънувате или разговаряте с адютант — щастие за вас и ваш любим човек; ако е натоварен със специална задача — ще получите писмо отдалеч с важни за вас новини; ако сте вие — ще получите благодарност за вашата добрина."
        )

        dreams.add(dream22)

        val dream23 = Dream(
            "АЕРОДРУМ, АЕРОГАРА",
            "Ако сънувате аеродрум или аерогара — очаква ви дълъг път; ако бягате по тях — ще намерите мир и духовно спокойствие."
        )

        dreams.add(dream23)

        val dream24 = Dream(
            "АЕРОСТАТ",
            "Ако сънувате аеростат — очакват ви интересни събития; ако с него се издигате над земята — ще достигнете до сладостното опиянение в любовта."
        )

        dreams.add(dream24)

        val dream25 = Dream(
            "АЗАЛИЯ",
            "Ако сънувате азалия — трябва да се пазите от подмазвачите, които ви заобикалят."
        )

        dreams.add(dream25)

        val dream26 = Dream(
            "АЗБЕСТ",
            "Ако сънувате азбест — заплашва ви пожар, но ако наистина избухне такъв, ще имате само материални щети и те ще ви бъдат заплатени, ако действате както трябва."
        )

        dreams.add(dream26)

        val dream27 = Dream(
            "АЗБУКА",
            "Ако сънувате или четете азбука — не трябва да разчитате само на вашите възможности; ако друг я чете — ще имате многобройно потомство; ако я гледате — опасност и нестабилност ви очакват; ако я учите — очакват ви големи неприятности; ако я чувате — неприятности на работата ви; ако я купувате — неочаквано пътешествие; ако някой друг я изучава — предстоят ви нови изпитания, ще попаднете в опасност."
        )

        dreams.add(dream27)

        val dream28 = Dream(
            "АЗИАТЕЦ",
            "Ако сънувате азиатец — вж. ЧУЖДЕНЕЦ."
        )

        dreams.add(dream28)

        val dream29 = Dream(
            "АКАДЕМИК",
            "Ако сънувате или разговаряте с академик — голяма печалба или авторитет сред вашите близки; ако сте вие — бъдете мъдри и внимателни."
        )

        dreams.add(dream29)

        val dream30 = Dream(
            "АКАДЕМИЯ",
            "Ако сънувате академия — очакват ви интересни новини; ако сте вътре в нея — ще получите дългоочакваното писмо."
        )

        dreams.add(dream30)

        val dream31 = Dream(
            "АКАЦИЯ",
            "Ако сънувате акация — на вас ви завиждат хора; ако е голяма — не приемайте никакви предложения, свързани с вашата работа; ако цъфти — ще получите приятно известие, свързано с вашия бизнес; ако ви я дават — големи почести от страна на обществото; ако се разхождате по алея от акации — ще попаднете в безизходно положение."
        )

        dreams.add(dream31)

        val dream32 = Dream(
            "АКВАРЕЛ",
            "Ако сънувате картина от акварел — радост и семейно щастие; ако рисувате с акварел — ще имате добър материален доход."
        )

        dreams.add(dream32)

        val dream33 = Dream(
            "АКВАРИУМ",
            "Ако сънувате аквариум, пълен с риби — това е предзнаменование за богатство и продължително щастие; ако е празен или разбит — неприятности и любовни проблеми."
        )

        dreams.add(dream33)

        val dream34 = Dream(
            "АКОМПАНИМЕНТ",
            "Ако сънувате акомпанимент — неочаквано известие от добър приятел; ако вие акомпанирате — ще откриете вашия враг."
        )

        dreams.add(dream34)

        val dream35 = Dream(
            "АКОРДЕОН",
            "Ако сънувате акордеон — очаква ви голям семеен празник; ако свирите на него — ще имате успех в любовта; ако го гледате или купувате — голяма материална загуба."
        )

        dreams.add(dream35)

        val dream36 = Dream(
            "АКРОБАТ",
            "Ако сънувате акробат — неочаквано ще преодолеете нещо; ако са няколко — ще се запознаете с приятен за вас човек; ако той танцува по въже — веселие; ако прави разни номера — ще бъдете огорчен от скъп за вас човек; ако си почива — предстои ви тежка борба в живота; ако вие сте — ще избегнете големи неприятности."
        )

        dreams.add(dream36)

        val dream37 = Dream(
            "АКТ (документ)",
            "Ако сънувате акт — дълъг път; ако го четете — предстои ви повишение в службата; ако го подписвате — внимавайте, това е лош знак за вас; ако слушате четене на акт — грози ви опасност."
        )

        dreams.add(dream37)

        val dream38 = Dream(
            "АКТЬОР, АКТРИСА",
            "Ако сънувате актьори — това е предзнаменование за удоволствия я забавления, която са доста повърхностни, с не много искрени приятели; ако говорите с тях — предстои ви хубава авантюра, свързана с хубави лични преживявания; ако това е мъж — до вас стои лицемерен приятел; ако е жена — новост, измяна в любовта, оскърбени чувства; ако вие сте актьор — нещо, което сте предприели, ще се увенчае с успех."
        )

        dreams.add(dream38)

        val dream39 = Dream(
            "АКУЛА",
            "Ако сънувате акула — очаква ви някакво наследство, но бъдете благоразумни и поверете интересите си на сигурни хора; ако плува — проблеми в интимния ви живот; ако ви настига и захапва — ще получите поредния удар в живота; ако е ранена — нападки от непознати за вас хора, загуба на пари."
        )

        dreams.add(dream39)

        val dream40 = Dream(
            "АКУМУЛАТОР",
            "Ако сънувате акумулатор — ще ви спасят ваши умни идеи."
        )

        dreams.add(dream40)

        val dream41 = Dream(
            "АКУШЕР, АКУШЕРКА",
            "Ако сънувате акушер — ще научите тайна, която ще ви донесе добро; ако видите акушери със запретнати ръкава или по време на работа — проява на болест във вас; ако сънувате акушерка — за семейните значи радост, за не-семейни — обида; ако говорите с нея — голяма радост; ако е с окървавени ръце — неочаквано ще получите пари; ако вие сте акушер, акушерка — вие сте прекалено голям оптимист."
        )

        dreams.add(dream41)

        val dream42 = Dream(
            "АКЦИИ",
            "Ако сънувате или купувате акции — ще имате неприятности, свързани с ваша работа; ако ги продавате — вашата мечта ще се осъществи."
        )

        dreams.add(dream42)

        val dream43 = Dream(
            "АКЦИОНЕР",
            "Ако сънувате акционер — очаква ви успех в бизнеса; ако говорите с него — не залагайте, ще загубите; ако вие сте акционер — ще имате нужда от пари."
        )

        dreams.add(dream43)

        val dream44 = Dream(
            "АЛАБАСТЪР",
            "Ако сънувате или сте посипани с алабастър — не е добър знак за този, който има любовница или любовник."
        )

        dreams.add(dream44)

        val dream45 = Dream(
            "АЛАРМА",
            "Ако сънувате, че чувате аларма — бъдете много внимателни с вашите близки."
        )

        dreams.add(dream45)

        val dream46 = Dream(
            "АЛБУМ",
            "Ако сънувате албум — неочаквана среща; ако го прелиствате — очаквайте среща с човек, когото отдавна сте искали да видите; ако е със стари снимки — приятна вест; ако го купувате — неочаквани събития; ако е скъсан — ще ви посетят неприятни за вас хора."
        )

        dreams.add(dream46)

        val dream47 = Dream(
            "АЛГЕБРА",
            "Ако сънувате, че изучавате алгебра — очаква ви неудача в личния живот; ако я преподавате — отмъщение."
        )

        dreams.add(dream47)

        val dream48 = Dream(
            "АЛЕГОРИЯ",
            "Ако сънувате алегория — за вас този сън е много добър признак, свързан с благополучието на вашето начинание."
        )

        dreams.add(dream48)

        val dream49 = Dream(
            "АЛЕЯ",
            "Ако сънувате алея — изключително добро предзнаменование; ако дърветата в нея са високи — трябва да положите много усилия, преди да осъществите желанията си; ако е в парк — близък човек ще ви измени; ако е в гробище — съмненията ви са неоправдани; ако е в гората — невероятна любов; ако е в полето — очаква ви веселба; ако е слънчева — ще чуете приятни за вас новини; ако е тъмна — знак за нещастно пътешествие."
        )

        dreams.add(dream49)

        val dream50 = Dream(
            "АЛИБИ",
            "Ако сънувате, че имате или друг има алиби — благоприятно разрешаване на деловите ви проблеми; ако го нямате — съд на хората."
        )

        dreams.add(dream50)

        val dream51 = Dream(
            "АЛИЛУЯ",
            "Ако сънувате, че чуете алилуя — радост както за вас, така и за вашето семейство; ако вие я пеете — успех в работата ви."
        )

        dreams.add(dream51)

        val dream52 = Dream(
            "АЛИНЕЯ (закон)",
            "Ако сънувате, че четете, слушате или виждате алинея — ще напреднете бързо във вашата кариера."
        )

        dreams.add(dream52)

        val dream53 = Dream(
            "АЛКОХОЛ, СПИРТ",
            "Ако сънувате алкохол — подсигурете добре личното си щастие, защото може да имате затруднения в тази част; ако го горите — щастието ще увенчае усилия ви; ако го употребявате, пиете — вие ще бъдете напълно здрав и богатството ви ще се увеличи; ако се напиете от него — това е лошо предзнаменование, защото има възможност да се опетните заради някоя ваша постъпка и да бъдете наказани от правосъдието; ако се напиете от пелин — ще се запознаете с влиятелен човек, който ще ви помогне; ако повръщате от него — има опасност да загубите състоянието си, но ако сте комарджия — ще загубите; ако ви заболи сърце от напиване — ще бъдете обран от приятелите си."
        )

        dreams.add(dream53)

        val dream54 = Dream(
            "АЛМАНАХ",
            "Ако сънувате алманах — очаква ви голяма опасност, особено ако животът ви е нередовен."
        )

        dreams.add(dream54)

        val dream55 = Dream(
            "АЛОЕ (растение)",
            "Ако сънувате, че режете или правете нещо с алое — очаквайте промени в живота; ако себе си покривате с тях — не залагайте на четни числа."
        )

        dreams.add(dream55)

        val dream56 = Dream(
            "АЛПИНИСТ",
            "Ако сънувате или говорите с алпинист — неизбежно препятствие; ако вие сте алпинист — клюки по ваш адрес."
        )

        dreams.add(dream56)

        val dream57 = Dream(
            "АЛУМИНИЙ",
            "Ако сънувате, че държите или топите алуминий — чакайте голямо пътешествие, свързано с много интересни и емоционални нощи."
        )

        dreams.add(dream57)

        val dream58 = Dream(
            "АЛХИМИК",
            "Ако сънувате или говорите с алхимик — сексуалните ви желания са неудовлетворени; ако вие сте алхимик — имате неограничени природни възможности, които трябва да реализирате."
        )

        dreams.add(dream58)

        val dream59 = Dream(
            "АЛЧЕН",
            "Ако сънувате, че сте или друг е алчен — ще загубите в живота."
        )

        dreams.add(dream59)

        val dream60 = Dream(
            "АМАЗОНКА",
            "Ако сънувате амазонка — вие действате без да мислите; ако е на кон — измяна от страна на ваша любима, любим; ако върви — нещастие ще ви избегне; ако вие сте амазонка — неочаквани събития."
        )

        dreams.add(dream60)

        val dream61 = Dream(
            "АМАТЬОР",
            "Ако сънувате или говорите с аматьор — бъдете пестеливи; ако сънувате, че сте аматьор — новото ви начинание ще се увенчае с успех."
        )

        dreams.add(dream61)

        val dream62 = Dream(
            "АМБИЦИОЗЕН",
            "Ако сънувате амбициозен човек — благополучно ще преодолеете препятствие; ако вие сте амбициозни — проявена неблагодарност към вас ще ви натъжи."
        )

        dreams.add(dream62)

        val dream63 = Dream(
            "АМБРОЗИЯ",
            "Ако сънувате амброзия — ще попаднете под влиянието на жестока лъжа; ако я пиете — скорошно придобиване с пари или вещ."
        )

        dreams.add(dream63)

        val dream64 = Dream(
            "АМБУЛАТОРИЯ",
            "Ако сънувате, че сте в амбулатория — ще получите вест, която ще ви натъжи; ако излизате от нея — скорошно оздравяване на ваш роднина."
        )

        dreams.add(dream64)

        val dream65 = Dream(
            "АМВОН",
            "Ако сънувате амвон — очаква ви добро и благополучие; ако се изкачвате по него — ще откриете нещо, което ще ви направи богат; ако духовно лице сънува амвон — вие ще получите повишение."
        )

        dreams.add(dream65)

        val dream66 = Dream(
            "АМЕРИКА",
            "Ако сънувате, че пътувате или живеете в Америка — лесно ще избегнете неприятностите."
        )

        dreams.add(dream66)

        val dream67 = Dream(
            "АМЕРИКАНЕЦ",
            "Ако сънувате, че сте или друг е американец или говорите с него — важно за вас желание ще се изпълни."
        )

        dreams.add(dream67)

        val dream68 = Dream(
            "АМЕТИСТ",
            "Ако сънувате аметист — успех в бизнеса; ако ви го подаряват — предстои ви среща с надменен човек; ако го държите в ръка — очаквайте неканени гости; ако го продавате — радост; ако го купувате — неизвестност ви очаква."
        )

        dreams.add(dream68)

        val dream69 = Dream(
            "АМНИСТИЯ",
            "Ако сънувате, че получавате амнистия — неочакван поврат във вашата работа; ако друг я получава — ще бъдете облагодетелствувани."
        )

        dreams.add(dream69)

        val dream70 = Dream(
            "АМПЛОА",
            "Ако сънувате, че вие или друг има свое амплоа — ще бъдете удовлетворени от своята работа и това ще повдигне вашето самочувствие в обществените кръгове."
        )

        dreams.add(dream70)

        val dream71 = Dream(
            "АМПУТАЦИЯ",
            "Ако сънувате ампутация — загуба; ако на вас ви ампутират някой крайник — ще загубите близък човек."
        )

        dreams.add(dream71)

        val dream72 = Dream(
            "АМУР",
            "Ако сънувате Амур — вас ви очаква спокойна, наситена с емоционалност, искрена любов."
        )

        dreams.add(dream72)

        val dream73 = Dream(
            "АМФИБИЯ",
            "Ако сънувате амфибия — очаквайте положителни промени във вашия живот."
        )

        dreams.add(dream73)

        val dream74 = Dream(
            "АМФИТЕАТЪР",
            "Ако сънувате или сте в него — ще ви напра-вят за смях пред вашите подчинени."
        )

        dreams.add(dream74)

        val dream75 = Dream(
            "АМФОРА",
            "Ако сънувате амфора — ще се радвате на добро здраве и дълъг живот; ако пиете от нея — ще получите тайнствено предложение."
        )

        dreams.add(dream75)

        val dream76 = Dream(
            "АНАЛИЗ",
            "Ако сънувате, че правите анализ — очаква ви голямо тичане, за да разрешите личните си проблеми."
        )

        dreams.add(dream76)

        val dream77 = Dream(
            "АНАЛОЙ",
            "Ако сънувате аналой — светкавичен успех."
        )

        dreams.add(dream77)

        val dream78 = Dream(
            "АНАНАС",
            "Ако сънувате ананас — това означава благополучие; ако го ядете — неочаквани събития; ако го варите — ще се запознаете със семейство, което ще помогне да разрешите важен проблем; ако е цъфтящ — успех; ако го купувате — печалба; ако ядете сладко от ананас — добра вест, свързана с ваш успех."
        )

        dreams.add(dream78)

        val dream79 = Dream(
            "АНАРХИСТ",
            "Ако сънувате или говорите с анархист — ще ви наклеветят; ако вие сте анархист — неприятности в работата."
        )

        dreams.add(dream79)

        val dream80 = Dream(
            "АНАТЕМА",
            "Ако сънувате, че произнасяте или друг произнася анатема — неочаквано ще получите наследство, което ще промени начина ви на живот."
        )

        dreams.add(dream80)

        val dream81 = Dream(
            "АНАТОМ",
            "Ако сънувате или говорите с анатом — семейни неприятности; ако вие сте анатом — ще постигнете високо обществено положение."
        )

        dreams.add(dream81)

        val dream82 = Dream(
            "АНГАЖИМЕНТ",
            "Ако получавате ангажимент — незабавно трябва да си разрешите проблемите; ако друг го получава — избягвайте да се доверявате."
        )

        dreams.add(dream82)

        val dream83 = Dream(
            "АНГЕЛ",
            "Ако сънувате Ангел — това показва желание за скъсване със земните връзки, със задълженията, на ежедневието. Ангелът може да носи само добри вести; ако е само един — ще бъдете покровителствувани от човек с високо социално положение, което ще ви даде възможност да се сдобиете е богатство и слава; ако лети. — ще бъдете щастливи; ако е обгърнат със светлина или бял плат — ще бъдете много богати; ако болен човек сънува Ангела, — скоро ще оздравее; ако стар сънува Ангела — очаквайте синове и дъщери от чужбина; ако момче сънува Ангел, то вие ще се ожените за тази, която обичате; ако го сънувате на празник — на добро е; ако е делник — за здрав човек — радост, а за болен — трудно оздравяване; ако са много — ще се отървете от болест; ако летят по небето — ще бъдете щастливи до старини; ако сте под тяхното крило — вас ви покровителства съдбата; ако вие се сънувате като Ангел — ще ви окажат голяма чест."
        )

        dreams.add(dream83)

        val dream84 = Dream(
            "АНГЕЛСКИ ПОДАРЪК",
            "Ако сънувате ангелски подарък — ще зарадва някого."
        )

        dreams.add(dream84)

        val dream85 = Dream(
            "АНГЕЛСКО ДЪРВО",
            "Ако сънувате ангелско дърво — чакайте много скъп за вас и вашето семейство приятел."
        )

        dreams.add(dream85)

        val dream86 = Dream(
            "АНГИНА",
            "Ако сънувате, че сте болни от ангина — това често е признак, че действително имате проблеми с гърлото; ако друг е болен от нея — вие пазите тайна, която ви задушава, но която ви е трудно да споделите."
        )

        dreams.add(dream86)

        val dream87 = Dream(
            "АНГЛИЧАНИН",
            "Ако сънувате или говорите с англичанин — ваш богат стар роднина, на когото сте наследник, не е доволен от вашите постъпки; ако вие сте англичанин — ще ви излъже близък приятел."
        )

        dreams.add(dream87)

        val dream88 = Dream(
            "АНЕКДОТ",
            "Ако сънувате, че четете анекдот — предстои ви радостно събитие; ако го слушате — ще получите неприятни известия; ако го разказвате — ще получите пари за положения от вас труд."
        )

        dreams.add(dream88)

        val dream89 = Dream(
            "АНЕМИЯ",
            "Ако сънувате, че вие или друг боледува от анемия — ще загубите верен за вас приятел."
        )

        dreams.add(dream89)

        val dream90 = Dream(
            "АНКЕТА",
            "Ако сънувате, че попълвате, четете или носите анкета — ще научите добри и полезни за вас новини."
        )

        dreams.add(dream90)

        val dream91 = Dream(
            "АНОНИМНО",
            "Ако сънувате анонимно писмо, известие, обаждане — времето е благоприятно да започнете бизнес; ако вие сте автор на анонимката — ще научите интересни новини."
        )

        dreams.add(dream91)

        val dream92 = Dream(
            "АНСАМБЪЛ",
            "Ако сънувате ансамбъл — вас ще ви излъжат; ако го виждате или свирите в него — пазете дома си от кражба."
        )

        dreams.add(dream92)

        val dream93 = Dream(
            "АНТЕНА",
            "Ако сънувате антена — очакват ви проблеми в работата; ако я поставяте или настройвате — благоприятна за вас промяна."
        )

        dreams.add(dream93)

        val dream94 = Dream(
            "АНТЕРИЯ",
            "Ако сънувате антерия — показва женско постоянство; ако е увиснала на стена — вярност и силна любов от страна на любимия (любимата); ако се облечете с нея — очаква ви материално затруднение."
        )

        dreams.add(dream94)

        val dream95 = Dream(
            "АНТИКВАР",
            "Ако видите или говорите с антиквар — не се доверявайте на жени; ако вие сте антиквар — ще се разкрият отминали, неприятни тайни, свързани с теб."
        )

        dreams.add(dream95)

        val dream96 = Dream(
            "АНТИКВАРЕН МАГАЗИН",
            "Ако сънувате антикварен магазин — те получите неочаквано наследство от далечен роднина, но ще се опитат да го отнемат; ако сте в него — материално сте обезпечени."
        )

        dreams.add(dream96)

        val dream97 = Dream(
            "АНТИКИ",
            "Ако сънувате, че разглеждате, продавате, купувате антики — ще си създадете грижи."
        )

        dreams.add(dream97)

        val dream98 = Dream(
            "АНТИЛОПА",
            "Ако сънувате антилопа — вашето желание няма да се сбъдне; ако я гоните — ще имате семейни неприятности."
        )

        dreams.add(dream98)

        val dream99 = Dream(
            "АНТИПАТИЯ",
            "Ако изпитвате към някого антипатия — ще се срещнете със стар приятел; ако към Вас изпитват антипатия — не сте желан гост."
        )

        dreams.add(dream99)

        val dream100 = Dream(
            "АНТУРАЖ",
            "Ако сънувате, че вие или друг участва в антураж — ще загубите работното си място."
        )

        dreams.add(dream100)

        val dream101 = Dream(
            "АПАРАТУРА",
            "Ако сънувате, че гледате или работите на апаратура — бъдете готови за неочаквано отпътуване."
        )

        dreams.add(dream101)

        val dream102 = Dream(
            "АПАРТАМЕНТ",
            "Ако сънувате богато обзаведен апартамент вашето прекалено разточителство, чиято единствена цел е да ви издигне в очите на другите, ще ви доведе до много затруднено материално положение; ако го посещавате — положението ви в обществото ще се промени в положителна или отрицателна посока, в зависимост от това дали състоянието на апартамента е добро или лошо; ако не го притежавате — ще спечелите благодарение на труда, който ще положите."
        )

        dreams.add(dream102)

        val dream103 = Dream(
            "АПЕЛИРАНЕ",
            "Ако сънувате, че апелирате — ще надвиете злото, което ви е сполетяло; ако друг апелира — доверете се, за да спечелите нужния за вас човек."
        )

        dreams.add(dream103)

        val dream104 = Dream(
            "АПЕРИТИВ",
            "Ако сънувате аперитив — признак за успех във всяка една област за издигане в живота; ако го пиете — здравословното ви състояние е нормално; ако друг го пие — помислете за семейството си."
        )

        dreams.add(dream104)

        val dream105 = Dream(
            "АПЕТИТ",
            "Ако сънувате, че имате апетит — скорошен успех ви предстои; ако го нямате — вас ще ви излъжат, но за ваше щастие, безуспешно."
        )

        dreams.add(dream105)

        val dream106 = Dream(
            "АПЛИКАЦИИ",
            "Ако сънувате или правите апликация — очаквайте колкото и странно да звучи, любов с човек от вашия пол."
        )

        dreams.add(dream106)

        val dream107 = Dream(
            "АПЛОДИСМЕНТИ",
            "Ако сънувате, че чувате аплодисменти — ще успеете да наложите вашия интерес; ако са за вас — скорошен успех."
        )

        dreams.add(dream107)

        val dream108 = Dream(
            "АПЛОМБ",
            "Ако сънувате апломб — ще се сдобиете с желана вещ."
        )

        dreams.add(dream108)

        val dream109 = Dream(
            "АПОГЕЙ",
            "Ако сънувате, че вие или друг достига своя апогей — бъдете внимателни както с вашия автомобил, така и с други автомобили."
        )

        dreams.add(dream109)

        val dream110 = Dream(
            "АПОПЛЕКТИЧЕН УДАР",
            "Ако сънувате, че преживявате апоплектичен удар — ще загубите неочаквано вашето наследство; ако друг го преживява — това е признак на сила й добро здраве."
        )

        dreams.add(dream110)

        val dream111 = Dream(
            "АПОСТОЛ",
            "Ако сънувате, че говори апостол с вас — думите му ще добият важно за вас значение; ако четете „Апостола“ или слушате като ви го четат — ще се убедите в истинността на нещата."
        )

        dreams.add(dream111)

        val dream112 = Dream(
            "АПТЕКА",
            "Ако сънувате, че гледате аптека — очаква ви болест; ако сте в нея — вашите дългове ще се увеличават; ако излизате от нея — успех в работата; ако купувате лекарства от нея — ще изпитате необоснован страх и несигурност."
        )

        dreams.add(dream112)

        val dream113 = Dream(
            "АПТЕКАР",
            "Ако сънувате, че говорите с аптекар — неприятности, семейно нещастие, загуба; ако вие сте аптекар — ще научите лоши новини."
        )

        dreams.add(dream113)

        val dream114 = Dream(
            "АРАБИН",
            "Ако сънувате арабин — очаква ви радост; ако говорите с него — ще получите информация за добра работа; ако се карате с него — ще получите новини за роднини, за които не сте чували нищо отдавна; ако вие се сънувате като арабин — ще положите напразен труд; ако сте арабин и живеете в пустиня — скоро ще имате възможността да пътувате до много далечно място."
        )

        dreams.add(dream114)

        val dream115 = Dream(
            "АРЕНА",
            "Ако сънувате арена — успех, но с лош за вас край; ако сте на нея — предстои ви любов с човек, който ще ви закриля."
        )

        dreams.add(dream115)

        val dream116 = Dream(
            "АРЕСТ",
            "Ако сънувате, че сте или друг е в арест — вие сте наклеветен."
        )

        dreams.add(dream116)

        val dream117 = Dream(
            "АРЕСТАНТ",
            "Ако сънувате, че виждате или говорите с арестант — това е знак за радост и веселие; ако вие сте арестант — ще откриете тайна, която ще ви донесе успех."
        )

        dreams.add(dream117)

        val dream118 = Dream(
            "АРИСТОКРАТ",
            "Ако сънувате или говорите с аристократ — ще получите известие, което ще промени вашия живот; ако сте вие — ще имате грижи, свързани с ваша роднина."
        )

        dreams.add(dream118)

        val dream119 = Dream(
            "АРИТМЕТИКА",
            "Ако сънувате, че изучавате аритметика — добри за вас събития, които ще ви издигнат."
        )

        dreams.add(dream119)

        val dream120 = Dream(
            "АРИЯ",
            "Ако сънувате, че слушате ария — неприятности с лоши за вас последствия; ако я пеете — радост."
        )

        dreams.add(dream120)

        val dream121 = Dream(
            "АРКА",
            "Ако сънувате, че минете под арка — неприятна изненада ви очаква; ако е хубава — успехът във вашата служебна работа ще се забави; ако е разрушена — очаква ви опасност."
        )

        dreams.add(dream121)

        val dream122 = Dream(
            "АРЛЕКИНО",
            "Ако сънувате Арлекино — ще ви измамят; ако вие сте облечени като Арлекино — ще ви направят за посмешище."
        )

        dreams.add(dream122)

        val dream123 = Dream(
            "АРМЕНЕЦ",
            "Ако сънувате или говорите с арменец — ваш добър приятел ще ви излъже; ако вие сте арменец — изневяра в семейството ви."
        )

        dreams.add(dream123)

        val dream124 = Dream(
            "АРМИЯ",
            "Ако сънувате сънища на военна тематика — в повечето случаи са предзнаменование за скарване, за спор; ако войниците в армията са в стройни редици — имате искрени я верни приятели; ако армията бяга — внимавайте да не влезете в спор заради някаква обида, която би ви донесла нещастие; ако вие сте в армията — може да ви сполети пожар, бъдете внимателни; ако военен сънува армия — очакват Ви военни маневри; ако армията марширува — ще имате добри доходи."
        )

        dreams.add(dream124)

        val dream125 = Dream(
            "АРОМАТИ",
            "Ако сънувате, че мажете главата си с някакви аромати или благовония — ще се прославите и ще бъдете уважаван; ако жена сънува този сън — ще изневери на съпруга си и след време ще му се подиграва; индийците и персийците вярвали, че този, който сънува главата или тялото си, намазани с някакви аромати или благовония — то те са почитани хора; ако ви дават аромати — ще получите благоприятно известие или пари, според количеството и качеството на ароматите; ако вие давате на приятеля си аромати — вие сте полезен за роднините си и те ви уважават."
        )

        dreams.add(dream125)

        val dream126 = Dream(
            "АРСЕНАЛ",
            "Ако сънувате арсенал — очакват ви големи неприятности, както на работното ви място, така и в семейството."
        )

        dreams.add(dream126)

        val dream127 = Dream(
            "АРТЕЛА",
            "Ако сънувате артела — случайна среща, която ще ви направи щастливи."
        )

        dreams.add(dream127)

        val dream128 = Dream(
            "АРТЕЛЧИК",
            "Ако сънувате или говорите с артелчик — очакват ви новости; ако вие сте артелчик — ще имате голяма промяна във вашата работа."
        )

        dreams.add(dream128)

        val dream129 = Dream(
            "АРТИКУЛ",
            "Ако сънувате артикули — бъдете внимателни, вие имате много недоброжелатели."
        )

        dreams.add(dream129)

        val dream130 = Dream(
            "АРТИЛЕРИСТ",
            "Ако сънувате артилерист или говорите с него — ще ви излъжат; ако вие сте артилерист — грози ви голяма опасност."
        )

        dreams.add(dream130)

        val dream131 = Dream(
            "АРТИЛЕРИЯ",
            "Ако сънувате артилерия — вашият враг го очаква гибел; ако тя отстъпва — ще загубите; артилерийски огън — предстои ви тежко изпитание."
        )

        dreams.add(dream131)

        val dream132 = Dream(
            "АРФА",
            "Ако сънувате арфа — неприятности; ако свирите на нея — имате приятен характер, благодарение на който ще възцарите спокойствието в семейството си; ако я чувате — вие сте верен любовник; ако е счупена — очаква ви приятна вечер с приятели; ако друг свири на нея — ще намерите утешител."
        )

        dreams.add(dream132)

        val dream133 = Dream(
            "АРХАНГЕЛ",
            "Ако сънувате архангел с тръба — в момент на затруднение ще намерите, спасение; ако е с меч — очаквайте скорошно възмездие."
        )

        dreams.add(dream133)

        val dream134 = Dream(
            "АРХЕОЛОГ",
            "Ако сънувате, че говорите с археолог — ще изобретите нещо, което може да ви донесе непоправими последствия; ако вие сте археолог — внимавайте да не загубите пари."
        )

        dreams.add(dream134)

        val dream135 = Dream(
            "АРХИВ",
            "Ако сънувате архив — очаквайте скоро да ви ограбят; ако ровите в него — вашата емоционалност ще ви донесе неприятности; ако го носите — ще получите дългоочакваното наследство."
        )

        dreams.add(dream135)

        val dream136 = Dream(
            "АРХИВАР",
            "Ако сънувате или говорите с архивар — имате или ще имате спестовна жена; ако вие сте архивар — ще имате големи разходи."
        )

        dreams.add(dream136)

        val dream137 = Dream(
            "АРХИЕПИСКОП",
            "Ако сънувате или говорите с него — ще се изпълни неприятно за вас желание; ако вие сте архиепископ — бъдете преди всичко духовни, а не материалисти."
        )

        dreams.add(dream137)

        val dream138 = Dream(
            "АРХИЕРЕЯ",
            "Ако сънувате, че говорите с него — ще получите справедливо възмездие; ако вие сте архиерей — обърнете внимание на здравословното си състояние."
        )

        dreams.add(dream138)

        val dream139 = Dream(
            "АРХИМАНДРИТ",
            "Ако сънувате или говорите с него — вашето търпение е на ръба; ако сте вие — очаква ви голяма радост."
        )

        dreams.add(dream139)

        val dream140 = Dream(
            "АРХИТЕКТ",
            "Ако сънувате архитект — ще имате големи грижи с ваш приятел; ако говорите с него — новости; ако вие сте архитект — голяма радост."
        )

        dreams.add(dream140)

        val dream141 = Dream(
            "БАБА",
            "Ако сънувате баба — ще получите добър съвет; ако сънувате като баба — ще узнаете тайна, касаеща вас; ако сънувате погребението и — нов човек в къщата ви; ако е вашата баба-семейна радост; ако баба ви и дядо ви са заедно, ще спечелите пари; ако е като акушерка — ще ви измени добър приятел; ако ви говори — скандал; ако са много — неочаквани събития; баба ви и дядо ви ако говорят насън — ще получите наследство; ако се карат — непредвиден доход ще получите."
        )

        dreams.add(dream141)

        val dream142 = Dream(
            "БАГАЖ",
            "Ако сънувате багаж — ще смените жилището си; го носите — вашето положение може да се промени; ако го местите — благоприятни променя в службата ви; ако друг го мести — ще имате неприятности; ако носите много тежък багаж — успех в замислената от вас работа; ако е на рамото ви — грижи."
        )

        dreams.add(dream142)

        val dream143= Dream(
            "БАГЕР",
            "Ако сънувате, че го карате или друг го кара — злополучие."
        )

        dreams.add(dream143)

        val dream144 = Dream(
            "БАДЕМ",
            "Ако сънувате бадем — тежко препятствие; бадемово дърво — успех; ако се качвате на него — ще получите похвала вашите началници; ако ви подадат клонче от него — скоро ще се сгодите, ако сте женени — ще имате син; ако са захаросани — добри новини, цъфнало бадемово дърво — кратък успех, ако не е цъфнало — очакват ви неуспехи в любовта."
        )

        dreams.add(dream144)

        val dream145 = Dream(
            "БАЕНЕ",
            "Ако, сънувате, че ви баят — ще имате неприятна среща."
        )

        dreams.add(dream145)

        val dream146 = Dream(
            "БАЗА",
            "Ако сънувате или ходите по нея — неочакван успех."
        )

        dreams.add(dream146)

        val dream147 = Dream(
            "БАЗАР",
            "Ако сънувате или сте на багер — компанията ви влияе положително; ако търгувате или купувате на него — болест, неочаквани затруднения."
        )

        dreams.add(dream147)

        val dream148 = Dream(
            "БАКАЛАВЪР",
            "Ако сънувате или разговаряте с него — с неподходящ за вас човек; ако сте вие — вълнение, болест."
        )

        dreams.add(dream148)

        val dream149 = Dream(
            "БАКЕНБАРДИ",
            "Ако сънувате, че сте с бакенбарди — ще получите пари; ако ги разчесвате насън — приятно удоволствие ще изживеете; ако ги бръснете — ще имате проблеми в служебните си работи."
        )

        dreams.add(dream149)

        val dream150 = Dream(
            "БАКЛАВА",
            "Ако сънувате, че ядете баклава — неприятни новини; ако друг я яде — проблеми, която е необходимо веднага да разрешите."
        )

        dreams.add(dream150)

        val dream151 = Dream(
            "БАКТЕРИЯ",
            "Ако сънувате бактерии — нещастие за ваш таен враг."
        )

        dreams.add(dream151)

        val dream152 = Dream(
            "БАКШИШ",
            "Ако сънувате, че получавате бакшиш — тежък разговор с хора, които са ви създавали проблеми; ако друг получава бакшиш — голяма печалба."
        )

        dreams.add(dream152)

        val dream153 = Dream(
            "БАКЪР",
            "Ако сънувате, че носите или купувате — ще загубите."
        )

        dreams.add(dream153)

        val dream154 = Dream(
            "БАЛ",
            "Ако сънувате бал — неприятна изненада; ако отивате на него — предстоят ви удоволствия; ако танцувате на него — здраве; ако е с маски — неприятности, може да загубите пари; ако е тъмно на него — ще имате недоразумение е интимен приятел; ако се смеете на него — раздяла с приятел."
        )

        dreams.add(dream154)

        val dream155 = Dream(
            "БАЛАДА",
            "Ако сънувате, че слушате или изпълнявате — работите ви ще потръгнат добре."
        )

        dreams.add(dream155)

        val dream156 = Dream(
            "БАЛАЛАЙКА",
            "Ако сънувате балалайка — очаква ви радост; ако свирите на нея — лъжлива любов; ако я слушате — сплетни."
        )

        dreams.add(dream156)

        val dream157 = Dream(
            "БАЛАСТ",
            "Ако сънувате, че изхвърляте баласт през кораб — ще се излекувате от болестта; ако го товарите — ще възникнат ненадейни проблеми в семейството ви."
        )

        dreams.add(dream157)

        val dream158 = Dream(
            "БАЛАСТРА",
            "Ако сънувате, баластра — очаквайте запознанство с нови приятели."
        )

        dreams.add(dream158)

        val dream159 = Dream(
            "БАЛДАХИН",
            "Ако сънувате балдахин — благополучие."
        )

        dreams.add(dream159)

        val dream160 = Dream(
            "БАЛДЪЗА",
            "Ако сънувате, че говорите с нея — големи неприятности ще имате."
        )

        dreams.add(dream160)

        val dream161 = Dream(
            "БАЛЕРИНА",
            "Ако сънувате балерина — вие сте оптимистичен човек; ако тя танцува — ще ви измамят; ако гледате балет — ще имате неприятности в работата си; ако вие танцувате балет на сцена — бракът ви ще бъде необичаен."
        )

        dreams.add(dream161)

        val dream162 = Dream(
            "БАЛЕТМАЙСТОР",
            "Ако сънувате или говорите с него — ще похарчите нужни за вас пари; ако вие сте балетмайстор — вашето желание ще се изпълни."
        )

        dreams.add(dream162)

        val dream163 = Dream(
            "БАЛКОН",
            "Ако сънувате, че мечтаете на балкон с жена — пазете се от злословията, те ще ви донесат неприятности; ако сте сам на него — вашите качества ще ви доведат до успехи, ако е разрушен — ще запазите авторитета си пред другите; ако е красиво направен — ще ви повишат в службата; ако скачате от него — успех в търговските работи; ако гледате от него надолу — положението ви е нестабилно."
        )

        dreams.add(dream163)


    return dreams
    }

}