package com.jpdevzone.knowyourdreams

object Constants {

    fun getDreams(): ArrayList<Dream> {
        val dreams = ArrayList<Dream>()

        val dream1 = Dream(
            "АБАЖУР",
            "Ако сънувате абажур — скоро ще тръгнете на неочакван път; ако го държите в ръка — това показва липса на искреност от ваша страна или от страна на тези, която вя заобикалят; ако абажурът е счупен — откажете се от пътуване."
        )

        dreams.add(dream1)

        val dream2 = Dream(
            "АБАТ",
            "Ако католик сънува абат — то на него му предстои голям успех; ако го виждате или само разговаряте с него — радост във вашето семейство."
        )

        dreams.add(dream2)

        val dream3 = Dream(
            "АБАТСТВО",
            "Ако сънувате абатство — ще имате морални или интелектуални затруднения; ако е развалено — идва край на мъките ви или поне те няма да продължават дълго."
        )

        dreams.add(dream3)

        val dream4 = Dream(
            "АБИТУРИЕНТ",
            "Ако сънувате абитуриент — ще научите лоша новина за този, когото сънувате като абитуриент; ако сте те Вие — на вашия път ще се изпречи препятствие."
        )

        dreams.add(dream4)

        val dream5 = Dream(
            "АБОРТ",
            "Ако сънувате или правите аборт — ще имате малки неприятности; ако друг го прави — клевета, страх."
        )

        dreams.add(dream5)

        val dream6 = Dream(
            "АВАНТЮРИСТ",
            "Ако сънувате или разговаряте с авантюрист — очаква ви опасност; ако сте вие — предстои ви дълга сексуална нощ."
        )

        dreams.add(dream6)

        val dream7 = Dream(
            "АВЕЛ",
            "Библейски брат на Каин. Ако сънувате или разговаряте с Авел — скръб; ако сте вие — ще имате големи грижи."
        )

        dreams.add(dream7)

        val dream8 = Dream(
            "АВТОБУС",
            "Ако сънувате автобус — очаква Ви професионален успех; ако се возите на него — очаква Ви забавяне на професионалното Ви издигане; ако е разбит — временен успех, ако не се погрижите той да продължи, понякога може и да означава проблем със здравето."
        )

        dreams.add(dream8)

        val dream9 = Dream(
            "АВТОМАТ",
            "Ако сънувате автомат (оръжие) — вие имате скрит враг; ако сънувате механична кукла или игрален автомат, — предвещава благополучие в духовния ви живот; ако е счупен — приятна беседа."
        )

        dreams.add(dream9)

        val dream10 = Dream(
            "АВТОМОБИЛ",
            "Ако сънувате или се возите на автомобил-ще имате успех в бизнеса; ако го гледате — очаквайте новини ако е катастрофирал — отложете плановете за деня; ако го купувате — предстои ви важно събитие; ако го продавате — предприятието ви ще сполучи."
        )

        dreams.add(dream10)

        val dream11 = Dream(
            "АВТОР",
            "Ако сънувате някой автор — очаква ви интересна и весела беседа; ако разговаряте или спорите с него — очаква Ви неудача в работата ви; ако сте вие — предстоят ви големи грижи."
        )

        dreams.add(dream11)

        val dream12 = Dream(
            "АГЕНТ",
            "Ако сънувате или разговаряте с агент — незабавно купете акции; ако сте вие — не се доверявайте на мъж за проблеми които ви безпокоят."
        )

        dreams.add(dream12)

        val dream13 = Dream(
            "АГИТАТОР",
            "Ако сънувате или разговаряте с агитатор - ще направите неприятно впечатление; ако сте вие — ще загубите честта си; ако се карате с него — вашето желание няма да се сбъдне."
        )

        dreams.add(dream13)

    return dreams
    }

}