package com.jpdevzone.knowyourdreams

object Constants {

    fun getDreams(): ArrayList<Dream> {
        val dreams = ArrayList<Dream>()

        val dream1 = Dream(
            "АБАЖУР",
            "Ако сънувате абажур — скоро ще тръгнете на неочакван път; ако го държите в ръка — това показва липса на искреност от ваша страна или от страна на тези, която вя заобикалят; ако абажурът е счупен — откажете се от пътуване."
        )

        dreams.add(dream1)

        val dream2 = Dream(
            "АБАТ",
            "Ако католик сънува абат — то на него му предстои голям успех; ако го виждате или само разговаряте с него — радост във вашето семейство."
        )

        dreams.add(dream2)

        val dream3 = Dream(
            "АБАТСТВО",
            "Ако сънувате абатство — ще имате морални или интелектуални затруднения; ако е развалено — идва край на мъките ви или поне те няма да продължават дълго."
        )

        dreams.add(dream3)

        val dream4 = Dream(
            "АБИТУРИЕНТ",
                    "Ако сънувате абитуриент — ще научите лоша новина за този, когото сънувате като абитуриент; ако сте те Вие — на вашия път ще се изпречи препятствие."
        )

        dreams.add(dream4)

    return dreams
    }

}